Revit 2027 API
Face.Intersect Method
Calculates the intersection of the specified curve with this face.
Overload List
Name | Description
Intersect(Curve) | Calculates the intersection of the specified curve with this face.
Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results.
Top
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace